recipes/enchilada-lasagne.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Enchilada Lasagne</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Enchilada Lasagne</h1>
<p>
<a href="https://www.emilieeats.com/vegan-enchilada-casserole/">Original link</a>
</p>

<div id="outline-container-org3b4165e" class="outline-2">
<h2 id="org3b4165e">Ingredients</h2>
<div class="outline-text-2" id="text-org3b4165e">
<ul class="org-ul">
<li>1 large bell pepper, thinly sliced</li>
<li>1/2 medium yellow onion, thinly sliced</li>
<li>2 cloves garlic, minced</li>
<li>1/2 teaspoon ground cumin</li>
<li>1/2 teaspoon ground paprika</li>
<li>2 1/4 cups enchilada sauce</li>
<li>18 corn tortillas</li>
<li>3 cups (2 15-ounce cans) low-sodium black beans, drained and rinsed</li>
<li>1 1/2 cups shredded vegan cheese</li>
</ul>
</div>
</div>

<div id="outline-container-org1bbd550" class="outline-2">
<h2 id="org1bbd550">Method</h2>
<div class="outline-text-2" id="text-org1bbd550">
<ol class="org-ol">
<li>Preheat oven to 180&deg;C.</li>
<li>In a medium skillet over medium heat, add oil. When hot, add bell pepper and onion. Sauté for 6-8 minutes, until tender. Add garlic, cumin, and paprika; cook for 1 minute, until fragrant.</li>
<li>In a 9x13 baking dish, layer casserole ingredients in this order: 3/4 cup enchilada sauce, 6 corn tortillas, 1 cup black beans, 1/2 cup sautéed vegetables, 1/2 cup vegan cheese. Repeat two more times.</li>
<li>Bake for 30 minutes. Let cool before serving.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
